app/controllers/v1/items_controller.rb

    def create
      @todo.items.create!(item_params) # will raise an error on validation failure catched by ExceptionHandler
---
INSERT INTO "items" ("name", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Listen the force"], ["todo_id", 2], ["created_at", "2019-08-21 14:53:14.006254"], ["updated_at", "2019-08-21 14:53:14.006254"]]

      def set_todo_item
        @item = @todo.items.find_by!(id: params[:id]) if @todo # will raise an error of RecordNotFound catched by ExceptionHandler
---
SELECT "items".* FROM "items" WHERE "items"."todo_id" = ?  [["todo_id", 2]]