app/controllers/v1/todos_controller.rb

    def create
      @todo = current_user.todos.create!(todo_params) # will raise an error on validation failure catched by ExceptionHandler
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Anakin Skywalker"], ["created_by", "1"], ["created_at", "2019-08-21 15:44:15.557867"], ["updated_at", "2019-08-21 15:44:15.557867"]]