app/auth/authorize_api_request.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def user
    # Check if the user is in the database
    # Memorize user object
    @user ||= User.find(decode_auth_token[:user_id]) if decode_auth_token