app/controllers/todos_controller.rb

  def create
    @todo = Todo.create!(todo_params) # will raise an error on validation failure catched by ExceptionHandler
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Some"], ["created_by", "1"], ["created_at", "2019-08-15 20:57:04.126821"], ["updated_at", "2019-08-15 20:57:04.126821"]]

    def set_todo
      @todo = Todo.find(params[:id]) # will raise an error of RecordNotFound catched by ExceptionHandler
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]