todo-api/app/auth/authenticate_user.rb

  def user
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "santiago.hyun@codescrum.com"], ["LIMIT", 1]]